podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/SPI0_MKV40F15.svd.xml
            <register>
               <name>RSER</name>
               <description>DMA/Interrupt Request Select and Enable Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>RFDF_DIRS</name>
                     <description>Receive FIFO Drain DMA or Interrupt Request Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DMA request</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFDF_RE</name>
                     <description>Receive FIFO Drain Request Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RFDF interrupt or DMA requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>RFDF interrupt or DMA requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RFOF_RE</name>
                     <description>Receive FIFO Overflow Request Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>RFOF interrupt requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>RFOF interrupt requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFFF_DIRS</name>
                     <description>Transmit FIFO Fill DMA or Interrupt Request Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TFFF flag generates interrupt requests</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TFFF flag generates DMA requests</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFFF_RE</name>
                     <description>Transmit FIFO Fill Request Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TFFF interrupts or DMA requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TFFF interrupts or DMA requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TFUF_RE</name>
                     <description>Transmit FIFO Underflow Request Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TFUF interrupt requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TFUF interrupt requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOQF_RE</name>
                     <description>Finished Request Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>EOQF interrupt requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>EOQF interrupt requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TCF_RE</name>
                     <description>Transmission Complete Request Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>TCF interrupt requests are disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>TCF interrupt requests are enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUSHR</name>
               <description>PUSH TX FIFO Register In Master Mode</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PCS</name>
                     <description>no description available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Negate the PCS[x] signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Assert the PCS[x] signal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTCNT</name>
                     <description>Clear Transfer Counter</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Do not clear the TCR[TCNT] field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clear the TCR[TCNT] field</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EOQ</name>
                     <description>End Of Queue</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The SPI data is not the last data to transfer</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The SPI data is the last data to transfer</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTAS</name>
                     <description>Clock and Transfer Attributes Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>CTAR0</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>CTAR1</description>
                           <value>0b001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CONT</name>
                     <description>Continuous Peripheral Chip Select Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Return PCSn signals to their inactive state between transfers</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Keep PCSn signals asserted between transfers</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PUSHR_SLAVE</name>
               <description>PUSH TX FIFO Register In Slave Mode</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POPR</name>
               <description>POP RX FIFO Register</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Received Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>TXFR%s</name>
               <description>Transmit FIFO</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXCMD_TXDATA</name>
                     <description>Transmit Command or Transmit Data</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>RXFR%s</name>
               <description>Receive FIFO</description>
               <addressOffset>0x7C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SREX</name>
               <description>Status register Extended</description>
               <addressOffset>0x13C</addressOffset>
               <fields>
                  <field>
                     <name>CMDNXTPTR</name>
                     <description>Command Next Pointer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDCTR</name>
                     <description>CMD FIFO Counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>TXCTR4</name>
                     <description>TX FIFO Counter[4]</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXCTR4</name>
                     <description>RX FIFO Counter[4]</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
